package ru.oktemsec.game100ykt.data

import ru.oktemsec.game100ykt.R
import ru.oktemsec.game100ykt.models.InformationCard
import ru.oktemsec.game100ykt.models.Question

class GameRepository {
    // Информационные карточки
    private val informations_array: Array<InformationCard> = arrayOf(
        InformationCard(R.drawable.game_area, "Близкими соратниками, единомышленниками и сподвижниками Платона Алексеевича Ойунского были: Аммосов Максим Кирович, советский государственный и партийный деятель, активный участник борьбы за установление Советской власти в Сибири. Вместе с Платоном Ойунским и Исидором Бараховым сыграл решающую роль в образовании Якутской АССР в апреле 1922 года. Председатель Совнаркома ЯАССР с 1925 по 1928 гг. В 1937 г. по указанию ЦК ВКП(б) приехал в столицу Киргизии, город Фрунзе, где проходил VIII пленум Киргизского обкома. 22 марта он был избран 1-м секретарем Киргизского областного комитета ВКП(б). В эти дни завершил свою работу V Чрезвычайный Всекиргизский съезд Советов, на котором под непосредственным руководством Максима Аммосова была принята Конституция Киргизской СССР. В суровые годы политических репрессий, также как и его соратники был арестован по ложному обвинению 16 ноября 1937 года в городе Фрунзе. Расстрелян 28 июля 1938 года в Москве. \n" +
                "Реабилитирован посмертно 28 апреля 1956 года определением Военной коллегии Верховного суда СССР.\n" +
                "\n" +
                "Аржаков Степан Максимович, якутский советский государственный, политический и хозяйственный деятель. Участник установления Советской власти в Якутии,  соратник Максима Аммосова, Платона Ойунского. Был одним из авторов «Декларации прав и обязанностей трудящихся Якутской АССР», имевшей большое политическое и правовое значение. Политические репрессии не обошли Степана Аржакова, он был арестован 5 февраля 1939 года, проходил по «процессу двадцати пяти». Постановлением Особого совещания НКВД СССР от 17 мая 1941 г. смертный приговор был заменён ссылкой в лагерь на 8 лет, этапирован в посёлок Певек. Однако дело было возобновлено вторично 17 мая 1941 года и 5 марта 1942 г., был осуждён Военным трибуналом войск НКВД по Дальстрою к высшей мере наказания. Расстрелян 17 мая 1942 года. \n" +
                "Реабилитирован 31 марта 1956 г. решением Президиума Верховного суда ЯАССР. (фото в папке)\n" +
                "\n" +
                "Барахов Исидор Никифорович, общественно - политический деятель, соратник Максима Аммосова и Платона Ойунского, стоял у истоков создания Якутской АССР. Тяжелое бремя политических репрессий не обошли и Исидора Никифоровича. 3 февраля 1938 г. был арестован в Москве на работе по делу «антисоветской националистической организации». 15 сентября 1938 г. Военная коллегия Верховного суда ССР приговорила его к высшей мере наказания, приговор приведен в исполнение в тот же день. Реабилитирован решением Военной коллегии Верховного суда СССР 31 октября 1956 г. (фото в папке) \n"),
        InformationCard(0, "Конституция РС(Я) – основной закон республики. Начинает свою историю с 1924г., когда было составлено Положение о ЯАССР, названное проектом Конституции ЯАССР. Первая Конституция ЯАССР (1925г.) провозгласила, что Якутия – автономная республика и нераздельная часть РСФСР. Вторая Конституция ЯАССР (1926г.) была переработана в соответствии с Конституцией РСФСР 1926г. и юридически закрепила создание ЯАССР как неразрывной части РСФСР. Третья Конституция ЯАССР (1937г.) закрепила новое государственное устройство республики, установила систему ее органов государственной власти и управления, определила принципы их организации и деятельности, основные права и обязанности граждане республики. Четвертая Конституция ЯАССР (1978г.) отражала успехи республики в социально-культурном строительстве, подтверждала ее государственно-правовой статус, учитывала новую демографическую ситуацию в республике, характер развития народного хозяйства. Пятая Конституция РС(Я) (1992г.) закрепляла, что РС(Я) является суверенным, демократическим и правовым государством, основанным на праве народа на самоопределение.")
    )

    // Вопросы
    private val questions_array: Array<Question> = arrayOf(
        Question(
            "Укажите трех выдающихся сынов народа саха, которые первыми отстаивали права якутов на государственном уровне перед монархами России.\n" +
                    "1. Василий Никифоров (Күлүмнүүр)\n" +
                    "2. Алексей Аржаков (Сэhэн Ардьакыап)\n" +
                    "3. Мазары Бозеков\n" +
                    "4. Софрон Сыранов (Дьокутаат)\n" +
                    "5. Ника Мымахов\n",
            0,
            "2. Алексей Аржаков (Сэhэн Ардьакыап),\n3. Мазары Бозеков,\n4. Софрон Сыранов (Дьокутаат)",
            0
        ),
        Question(
            "Назовите год написания именитого труда А.Е. Кулаковского «Письмо к якутской интеллигенции».",
            0,
            "1912 г.",
            0
        ),
        Question(
            "Летом 1917 г. усилиями якутской интеллигенции была создана партия, главной задачей которой было политическое развитие народа, организация и консолидация политических сил. Как называлась эта партия?\n" +
            "1. Союз «Свобода», преобразованный в Якутский трудовой союз федералистов (ЯТСФ)\n" +
            "2. Союз «Пролетарии всех стран, объединяйтесь!»\n" +
            "3. КПСС (Коммунистическая партия Советского Союза)\n",
            0,
            "1. Союз «Свобода», преобразованный в Якутский трудовой союз федералистов (ЯТСФ)",
            0
        ),
        Question(
            "Какой выдающийся представитель якутской интеллигенции поставил вопрос об образовании автономной Якутской республики в составе РСФСР перед бюро Российской Коммунистической Партии большевиков?",
            0,
            "Платон Алексеевич Ойунский",
            0
        ),
        Question(
            "Известно, что Ойунский – это псевдоним великого якутского писателя. Назовите настоящую фамилию Платона Алексеевича.",
            0,
            "Слепцов",
            0
        ),
        Question(
            "Как называется произведение Платона Ойунского, в котором он описал этапы развития Якутии?",
            0,
            "Великий столетний план. Сүүс сыллаах улуу былаан.",
            0
        ),
        Question(
            "Нестор Каландаришвили, революционный деятель, выехав на ликвидацию отрядов якутских повстанцев во время гражданской войны, попал в засаду и был убит. Назовите место гибели легендарного героя Гражданской войны.",
            0,
            "За деревней Техтюр на Хахсытской протоке",
            0
        ),
        Question(
            "Назовите трех близких соратников П.А. Ойунского.",
            0,
            "Аммосов Максим Кирович, Аржаков Степан Максимович, Барахов Исидор Никифорович",
            0
        ),
        Question(
            "В каком году была принята первая Конституция ЯАССР?",
            0,
            "1925 г.",
            0
        ),
        Question(
            "Чье имя носит Саха академический театр?",
            0,
            "П.А. Ойунского",
            0
        ),
        Question(
            "Первый аэроплан «Сопвич» взлетел с пристани «Даркылах» и совершил посадку на территории: \n" +
                    "1. Зеленого луга\n" +
                    "2. Магана\n" +
                    "3. Табаги\n",
            0,
            "1. Зеленого луга",
            0
        ),
        Question(
            "Когда началось изучение кимберлитовой трубки в Якутии?",
            0,
            "1954 г.",
            0
        ),
        Question(
            "Назовите автора-составителя первого словаря якутского языка.",
            0,
            "Эдуард Карлович Пекарский",
            0
        ),
        Question(
            "Назовите год начала якутского радиовещания.",
            0,
            "1930 г.",
            0
        ),
        Question(
            "Как называется одно из первых научных учреждений на Севере, образованное в 1949 г. как Якутский филиал Академии Наук СССР?",
            0,
            "Якутский научный центр",
            0
        ),
        Question(
            "В каком году успешно завершилось строительство первого в мире газопровода на вечной мерзлоте?",
            0,
            "1967 г.",
            0
        ),
        Question(
            "Что такое криохранилище?\n" +
                    "1. Подземная лаборатория \n" +
                    "2. Специализированные камеры с жидким азотом\n" +
                    "3. Музей\n",
            0,
            "2. Специализированные камеры с жидким азотом",
            0
        ),
        Question(
            "Чье имя носит Институт космических исследований и аэрономии СО АН СССР?",
            0,
            "Юрий Георгиевич Шафер",
            0
        ),
        Question(
            "Назовите имя знаменитого якутского тренера, воспитавшего первых олимпийских чемпионов из народа саха.",
            0,
            "Дмитрий Петрович Коркин",
            0
        ),
        Question(
            "Почему число «27» считается сакральным для народа саха?",
            0,
            "27 апреля 1922г. образована Якутская Автономная Советская Социалистическая Республика (ЯАССР).\n" +
                    "27 сентября 1990г. принята Декларация о государственном суверенитете Якутской - Саха ССР.\n" +
                    "27 апреля 1992г. принята современная Конституция Республики Саха (Якутия).\n",
            0
        ),
        Question(
            "Назовите дату провозглашения Декларации о государственном суверенитете, которая ознаменовала начало нового этапа развития государственности Якутии.",
            0,
            "27 сентября 1990 г.",
            0
        ),
        Question(
            "В 1996 году в ознаменование 100-летия современного Олимпийского движения по инициативе первого президента Республики Саха (Якутия) Михаила Николаева были организованы…",
            0,
            "Международные спортивные игры «Дети Азии»",
            0
        ),
        Question(
            "По чьей инициативе в 1991 году был создан Всемирный Музей мамонта?",
            0,
            "Петра Алексеевича Лазарева, первого якутского мамонтолога",
            0
        ),
        Question(
            "Что обозначают цвета флага РС(Я)?",
            R.drawable.flag_sakha,
            "Голубой цвет символизирует честь, верность, искренность и ясное мирное небо, является символом свободы и мира, красный – цвет силы, мужества, белый – цвет чистоты, мудрости, радости, зеленый цвет олицетворяет свободу и надежду.",
            0
        ),
        Question(
            "Что обозначает белый круг на государственном флаге РС(Я)?",
            R.drawable.flag_sakha,
            "Белое солнце занимает большое место в якутской мифологии, Саха считают себя «детьми белого солнца»",
            0
        ),
        Question(
            "Что изображено на гербе Республики Саха (Якутия)?",
            0,
            "Представляет собой круг, в центре которого расположено изображение древнего всадника со знаменем с наскальных рисунков реки Лены на фоне солнечного диска-щита, помещенного в обрамление с традиционным национальным орнаментом в виде семи ромбических кристаллообразных фигур и надписями.",
            0
        ),
        Question(
            "Назовите авторов гимна Республики Саха (Якутия).",
            0,
            "На языке саха Саввой Тарасовым и Михаилом Тимофеевым. Гимн переведён на русский язык Владимиром Фёдоровым.",
            0
        ),
        Question(
            "Уникальное медицинское учреждение в Якутии, в котором могут делать сложнейшие операции по трансплантации органов, проводятся глубинные исследования здоровья, в том числе и генные, – это…",
            0,
            "Медцентр",
            0
        ),
        Question(
            "Назовите древнейшее эпическое искусство якутов, которое в 2009 году было включено в список «нематериального наследия человечества» под эгидой ЮНЕСКО?",
            0,
            "Олонхо́ (якут. Олоҥхо)",
            0
        ),
        Question(
            "В каком году Национальный парк «Ленские столбы» вошел в число объектов всемирного наследия ЮНЕСКО?",
            0,
            "в 2012 г.",
            0
        ),
        Question(
            "Как называлось первое учебное заведение высшего образования в Якутии?",
            0,
            "Якутский педагогический институт",
            0
        )
    )

    // Задания
    private val challengeList = listOf(
        "Передай право хода следующему игроку",
        "Переходи по речке на другой квадратик",
        "Таймаут. Пропускаешь ход"
    )

    private val tableChallengeList = listOf(
        "Прочитай любое стихотворение",
        "Расскажи любой факт о декларации, который ты успел узнать",
        "Спой песню"
    )

    private val magnetoChallengeList = listOf(
        "Вы попали в магнитный поток. Иди на два шага назад",
        "Вы попали в магнитный поток. Иди на три шага вперед",
        "Вы попали в магнитный поток. Тебе повезло бери жетон"
    )

    // Методы информационные карточки
    fun getTextsList() : Array<String> {
        var result = emptyArray<String>()
        informations_array.forEachIndexed { index, _ ->
            result += informations_array[index].informationText
        }
        return result
    }
    fun getImagesList() : Array<Int>{
        var result = emptyArray<Int>()
        informations_array.forEachIndexed { index, _ ->
            result += informations_array[index].image
        }
        return result
    }


    // Методы вопросы
    fun getQuestionTextsList(): Array<String> {
        var result = emptyArray<String>()
        questions_array.forEachIndexed { index, _ ->
            result += questions_array[index].question
        }
        return result
    }
    fun getQuestionImagesList() : Array<Int> {
        var result = emptyArray<Int>()
        questions_array.forEachIndexed { index, _ ->
            result += questions_array[index].image
        }
        return result
    }
    fun getQuestionAnswersList() : Array<String> {
        var result = emptyArray<String>()
        questions_array.forEachIndexed { index, _ ->
            result += questions_array[index].answer
        }
        return result
    }

    // Методы задания
    fun getChallengesList(): List<String> {
        return challengeList
    }
    fun getTableChallengesList(): List<String> {
        return tableChallengeList
    }

    //Meridian
    fun getMagnetoChallengeList(): List<String> {
        return magnetoChallengeList
    }
}